this post is going to be long, sorry about that...

# terraform plan when everything is new:

```
$ terraform plan --out tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.azuread_service_principal.vault: Refreshing state...
data.azurerm_client_config.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_public_ip.tf_publicip will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_public_ip" "tf_publicip"  {
      + allocation_method       = (known after apply)
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = (known after apply)
      + ip_address              = (known after apply)
      + ip_version              = (known after apply)
      + location                = (known after apply)
      + name                    = (known after apply)
      + resource_group_name     = "rgl-test-vault-rg"
      + reverse_fqdn            = (known after apply)
      + sku                     = (known after apply)
      + zones                   = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.template_file.setup will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "setup"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            #!/bin/bash
            # NB this file will be executed as root by cloud-init.
            # NB to troubleshoot the execution of this file, you can:
            #      1. access the virtual machine boot diagnostics pane in the azure portal.
            #      2. ssh into the virtual machine and execute:
            #           * sudo journalctl
            #           * sudo journalctl -u cloud-final
            set -euxo pipefail
            
            ip_address="$(ip addr show eth0 | perl -n -e'/ inet (\d+(\.\d+)+)/ && print $1')"
            
            # install vault.
            # NB execute `apt-cache madison vault` to known the available versions.
            curl -fsSL https://apt.releases.hashicorp.com/gpg | apt-key add -
            apt-add-repository "deb [arch=amd64] https://apt.releases.hashicorp.com $(lsb_release -cs) main"
            apt-get install -y "vault=${vault_version}" jq
            cat >/etc/vault.d/vault.hcl <<EOF
            ui = true
            disable_mlock = true
            
            api_addr = "http://$ip_address:8200"
            cluster_addr = "http://$ip_address:8201"
            
            storage "file" {
              path = "/opt/vault/data"
            }
            
            listener "tcp" {
              address         = "0.0.0.0:8200"
              cluster_address = "0.0.0.0:8201"
              tls_disable     = 1
              telemetry {
                unauthenticated_metrics_access = true
              }
            }
            
            # enable the telemetry endpoint.
            # access it at http://<VAULT-IP-ADDRESS>:8200/v1/sys/metrics?format=prometheus
            # see https://www.vaultproject.io/docs/configuration/telemetry
            # see https://www.vaultproject.io/docs/configuration/listener/tcp#telemetry-parameters
            telemetry {
               disable_hostname = true
               prometheus_retention_time = "24h"
            }
            
            # enable auto-unseal using the azure key vault.
            seal "azurekeyvault" {
              client_id      = "${client_id}"
              client_secret  = "${client_secret}"
              tenant_id      = "${tenant_id}"
              vault_name     = "${vault_name}"
              key_name       = "${key_name}"
            }
            EOF
            systemctl enable vault
            systemctl restart vault
            
            cat >/etc/profile.d/vault.sh <<'EOF'
            export VAULT_ADDR=http://127.0.0.1:8200
            export VAULT_SKIP_VERIFY=true
            EOF
            
            # TODO why isn't this in $HOME?
            cat >/tmp/azure_auth.sh <<'EOF'
            #!/bin/bash
            set -euxo pipefail
            
            # for more information see:
            #   * https://www.vaultproject.io/docs/auth/azure
            #   * https://www.vaultproject.io/api/auth/azure
            
            vault auth enable azure
            
            vault write auth/azure/config \
              tenant_id="${tenant_id}" \
              resource="https://management.azure.com/" \
              client_id="${client_id}" \
              client_secret="${client_secret}"
            
            vault write auth/azure/role/dev-role \
              policies="default" \
              bound_subscription_ids="${subscription_id}" \
              bound_resource_groups="${resource_group_name}"
            
            # create a vault login token for the current virtual machine identity (as
            # returned by the azure instance metadata service).
            # NB use the returned token to login into vault using `vault login`.
            # see https://docs.microsoft.com/en-us/azure/active-directory/managed-identities-azure-resources/how-to-use-vm-token
            # see https://docs.microsoft.com/en-us/azure/virtual-machines/linux/instance-metadata-service
            vault write auth/azure/login \
              role="dev-role" \
              jwt="$(curl 'http://169.254.169.254/metadata/identity/oauth2/token?api-version=2018-02-01&resource=https%3A%2F%2Fmanagement.azure.com%2F' -H Metadata:true -s | jq -r .access_token)" \
              subscription_id="${subscription_id}" \
              resource_group_name="${resource_group_name}" \
              vm_name="${vm_name}"
            EOF
            chmod +x /tmp/azure_auth.sh
        EOT
      + vars     = {
          + "client_id"           = "redacted"
          + "client_secret"       = "redacted"
          + "key_name"            = "generated-key"
          + "resource_group_name" = "rgl-test-vault-rg"
          + "subscription_id"     = "redacted"
          + "tenant_id"           = "redacted"
          + "vault_name"          = (known after apply)
          + "vault_version"       = "1.5.0-2"
          + "vm_name"             = "azure-auth-demo-vm"
        }
    }

  # azurerm_key_vault.vault will be created
  + resource "azurerm_key_vault" "vault" {
      + access_policy          = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "get",
                  + "wrapKey",
                  + "unwrapKey",
                ]
              + object_id               = "26293dbd-aa2c-48b6-82b5-2914f166c131"
              + secret_permissions      = null
              + storage_permissions     = null
              + tenant_id               = "redacted"
            },
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "get",
                  + "list",
                  + "create",
                  + "delete",
                  + "update",
                ]
              + object_id               = "54699f32-69c3-43c7-8123-fd44df640077"
              + secret_permissions      = null
              + storage_permissions     = null
              + tenant_id               = "redacted"
            },
        ]
      + enabled_for_deployment = true
      + id                     = (known after apply)
      + location               = "uksouth"
      + name                   = (known after apply)
      + resource_group_name    = "rgl-test-vault-rg"
      + sku_name               = "standard"
      + tags                   = {
          + "environment" = "rgl-test"
        }
      + tenant_id              = "redacted"
      + vault_uri              = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # azurerm_key_vault_key.generated will be created
  + resource "azurerm_key_vault_key" "generated" {
      + curve        = (known after apply)
      + e            = (known after apply)
      + id           = (known after apply)
      + key_opts     = [
          + "wrapKey",
          + "unwrapKey",
        ]
      + key_size     = 2048
      + key_type     = "RSA"
      + key_vault_id = (known after apply)
      + n            = (known after apply)
      + name         = "generated-key"
      + version      = (known after apply)
      + x            = (known after apply)
      + y            = (known after apply)
    }

  # azurerm_linux_virtual_machine.tf_vm will be created
  + resource "azurerm_linux_virtual_machine" "tf_vm" {
      + admin_username                  = "azureuser"
      + allow_extension_operations      = true
      + computer_name                   = "azure-auth-demo-vm"
      + custom_data                     = (sensitive value)
      + disable_password_authentication = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + max_bid_price                   = -1
      + name                            = "azure-auth-demo-vm"
      + network_interface_ids           = (known after apply)
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "rgl-test-vault-rg"
      + size                            = "Standard_DS1_v2"
      + tags                            = (known after apply)
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = "redacted"
          + username   = "azureuser"
        }

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "azure-auth-demo-vm-os"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.tf_nic will be created
  + resource "azurerm_network_interface" "tf_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rgl-test-vault-rg"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = (known after apply)
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_network_interface_security_group_association.tf_nisga will be created
  + resource "azurerm_network_interface_security_group_association" "tf_nisga" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.tf_nsg will be created
  + resource "azurerm_network_security_group" "tf_nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = (known after apply)
      + resource_group_name = "rgl-test-vault-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "8200"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Vault"
              + priority                                   = 1002
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "8500"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Consul"
              + priority                                   = 1003
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = (known after apply)
    }

  # azurerm_public_ip.tf_publicip will be created
  + resource "azurerm_public_ip" "tf_publicip" {
      + allocation_method       = "Dynamic"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = (known after apply)
      + resource_group_name     = "rgl-test-vault-rg"
      + sku                     = "Basic"
      + tags                    = (known after apply)
    }

  # azurerm_resource_group.vault will be created
  + resource "azurerm_resource_group" "vault" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rgl-test-vault-rg"
      + tags     = {
          + "environment" = "rgl-test"
        }
    }

  # azurerm_storage_account.tf_storageaccount will be created
  + resource "azurerm_storage_account" "tf_storageaccount" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "uksouth"
      + name                             = (known after apply)
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "rgl-test-vault-rg"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = (known after apply)

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # azurerm_subnet.tf_subnet will be created
  + resource "azurerm_subnet" "tf_subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = "rgl-test-vault-rg"
      + virtual_network_name                           = (known after apply)
    }

  # azurerm_virtual_network.tf_network will be created
  + resource "azurerm_virtual_network" "tf_network" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = (known after apply)
      + resource_group_name = "rgl-test-vault-rg"
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # random_id.keyvault will be created
  + resource "random_id" "keyvault" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.tf_random_id will be created
  + resource "random_id" "tf_random_id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "rgl-test-vault-rg"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

# tfplan after commenting a key_permissions item

After commenting `"get"`:

```hcl
resource "azurerm_key_vault" "vault" {
  ...
  access_policy {
    tenant_id = var.tenant_id
    object_id = data.azuread_service_principal.vault.object_id

    key_permissions = [
      #"get",
      "wrapKey",
      "unwrapKey",
    ]
  }
```

The plan is:

```
$ terraform plan --out tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_id.keyvault: Refreshing state... [id=gLn_Xw]
data.azuread_service_principal.vault: Refreshing state...
data.azurerm_client_config.current: Refreshing state...
azurerm_resource_group.vault: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg]
random_id.tf_random_id: Refreshing state... [id=DUmWZjgE-pk]
azurerm_network_security_group.tf_nsg: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-80b9ff5f]
azurerm_virtual_network.tf_network: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Network/virtualNetworks/network-80b9ff5f]
azurerm_public_ip.tf_publicip: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Network/publicIPAddresses/ip-80b9ff5f]
azurerm_key_vault.vault: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.KeyVault/vaults/rgl-test-vault-80b9ff5f]
azurerm_storage_account.tf_storageaccount: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Storage/storageAccounts/sa80b9ff5f]
azurerm_subnet.tf_subnet: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Network/virtualNetworks/network-80b9ff5f/subnets/subnet-80b9ff5f]
azurerm_key_vault_key.generated: Refreshing state... [id=https://rgl-test-vault-80b9ff5f.vault.azure.net/keys/generated-key/f59e44c41ca44aa1b2a2adacf99cb873]
data.template_file.setup: Refreshing state...
azurerm_network_interface.tf_nic: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Network/networkInterfaces/nic-80b9ff5f]
azurerm_network_interface_security_group_association.tf_nisga: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Network/networkInterfaces/nic-80b9ff5f|/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-80b9ff5f]
azurerm_linux_virtual_machine.tf_vm: Refreshing state... [id=/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Compute/virtualMachines/azure-auth-demo-vm]
data.azurerm_public_ip.tf_publicip: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_public_ip.tf_publicip will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_public_ip" "tf_publicip"  {
      + allocation_method       = (known after apply)
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = (known after apply)
      + ip_address              = (known after apply)
      + ip_version              = (known after apply)
      + location                = (known after apply)
      + name                    = "ip-80b9ff5f"
      + resource_group_name     = "rgl-test-vault-rg"
      + reverse_fqdn            = (known after apply)
      + sku                     = (known after apply)
      + zones                   = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.template_file.setup will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "setup"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            #!/bin/bash
            # NB this file will be executed as root by cloud-init.
            # NB to troubleshoot the execution of this file, you can:
            #      1. access the virtual machine boot diagnostics pane in the azure portal.
            #      2. ssh into the virtual machine and execute:
            #           * sudo journalctl
            #           * sudo journalctl -u cloud-final
            set -euxo pipefail
            
            ip_address="$(ip addr show eth0 | perl -n -e'/ inet (\d+(\.\d+)+)/ && print $1')"
            
            # install vault.
            # NB execute `apt-cache madison vault` to known the available versions.
            curl -fsSL https://apt.releases.hashicorp.com/gpg | apt-key add -
            apt-add-repository "deb [arch=amd64] https://apt.releases.hashicorp.com $(lsb_release -cs) main"
            apt-get install -y "vault=${vault_version}" jq
            cat >/etc/vault.d/vault.hcl <<EOF
            ui = true
            disable_mlock = true
            
            api_addr = "http://$ip_address:8200"
            cluster_addr = "http://$ip_address:8201"
            
            storage "file" {
              path = "/opt/vault/data"
            }
            
            listener "tcp" {
              address         = "0.0.0.0:8200"
              cluster_address = "0.0.0.0:8201"
              tls_disable     = 1
              telemetry {
                unauthenticated_metrics_access = true
              }
            }
            
            # enable the telemetry endpoint.
            # access it at http://<VAULT-IP-ADDRESS>:8200/v1/sys/metrics?format=prometheus
            # see https://www.vaultproject.io/docs/configuration/telemetry
            # see https://www.vaultproject.io/docs/configuration/listener/tcp#telemetry-parameters
            telemetry {
               disable_hostname = true
               prometheus_retention_time = "24h"
            }
            
            # enable auto-unseal using the azure key vault.
            seal "azurekeyvault" {
              client_id      = "${client_id}"
              client_secret  = "${client_secret}"
              tenant_id      = "${tenant_id}"
              vault_name     = "${vault_name}"
              key_name       = "${key_name}"
            }
            EOF
            systemctl enable vault
            systemctl restart vault
            
            cat >/etc/profile.d/vault.sh <<'EOF'
            export VAULT_ADDR=http://127.0.0.1:8200
            export VAULT_SKIP_VERIFY=true
            EOF
            
            # TODO why isn't this in $HOME?
            cat >/tmp/azure_auth.sh <<'EOF'
            #!/bin/bash
            set -euxo pipefail
            
            # for more information see:
            #   * https://www.vaultproject.io/docs/auth/azure
            #   * https://www.vaultproject.io/api/auth/azure
            
            vault auth enable azure
            
            vault write auth/azure/config \
              tenant_id="${tenant_id}" \
              resource="https://management.azure.com/" \
              client_id="${client_id}" \
              client_secret="${client_secret}"
            
            vault write auth/azure/role/dev-role \
              policies="default" \
              bound_subscription_ids="${subscription_id}" \
              bound_resource_groups="${resource_group_name}"
            
            # create a vault login token for the current virtual machine identity (as
            # returned by the azure instance metadata service).
            # NB use the returned token to login into vault using `vault login`.
            # see https://docs.microsoft.com/en-us/azure/active-directory/managed-identities-azure-resources/how-to-use-vm-token
            # see https://docs.microsoft.com/en-us/azure/virtual-machines/linux/instance-metadata-service
            vault write auth/azure/login \
              role="dev-role" \
              jwt="$(curl 'http://169.254.169.254/metadata/identity/oauth2/token?api-version=2018-02-01&resource=https%3A%2F%2Fmanagement.azure.com%2F' -H Metadata:true -s | jq -r .access_token)" \
              subscription_id="${subscription_id}" \
              resource_group_name="${resource_group_name}" \
              vm_name="${vm_name}"
            EOF
            chmod +x /tmp/azure_auth.sh
        EOT
      + vars     = {
          + "client_id"           = "redacted"
          + "client_secret"       = "redacted"
          + "key_name"            = "generated-key"
          + "resource_group_name" = "rgl-test-vault-rg"
          + "subscription_id"     = "redacted"
          + "tenant_id"           = "redacted"
          + "vault_name"          = "rgl-test-vault-80b9ff5f"
          + "vault_version"       = "1.5.0-2"
          + "vm_name"             = "azure-auth-demo-vm"
        }
    }

  # azurerm_key_vault.vault will be updated in-place
  ~ resource "azurerm_key_vault" "vault" {
      ~ access_policy                   = [
          ~ {
                application_id          = ""
                certificate_permissions = []
              ~ key_permissions         = [
                  - "get",
                    "wrapKey",
                    "unwrapKey",
                ]
                object_id               = "redacted"
                secret_permissions      = []
                storage_permissions     = []
                tenant_id               = "redacted"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = [
                    "get",
                    "list",
                    "create",
                    "delete",
                    "update",
                ]
                object_id               = "redacted"
                secret_permissions      = []
                storage_permissions     = []
                tenant_id               = "redacted"
            },
        ]
        enabled_for_deployment          = true
        enabled_for_disk_encryption     = false
        enabled_for_template_deployment = false
        id                              = "/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.KeyVault/vaults/rgl-test-vault-80b9ff5f"
        location                        = "uksouth"
        name                            = "rgl-test-vault-80b9ff5f"
        purge_protection_enabled        = false
        resource_group_name             = "rgl-test-vault-rg"
        sku_name                        = "standard"
        soft_delete_enabled             = false
        tags                            = {
            "environment" = "rgl-test"
        }
        tenant_id                       = "redacted"
        vault_uri                       = "https://rgl-test-vault-80b9ff5f.vault.azure.net/"

        network_acls {
            bypass                     = "AzureServices"
            default_action             = "Allow"
            ip_rules                   = []
            virtual_network_subnet_ids = []
        }
    }

  # azurerm_linux_virtual_machine.tf_vm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "tf_vm" {
        admin_username                  = "azureuser"
        allow_extension_operations      = true
        computer_name                   = "azure-auth-demo-vm"
      ~ custom_data                     = (sensitive value)
        disable_password_authentication = true
      ~ id                              = "/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Compute/virtualMachines/azure-auth-demo-vm" -> (known after apply)
        location                        = "uksouth"
        max_bid_price                   = -1
        name                            = "azure-auth-demo-vm"
        network_interface_ids           = [
            "/subscriptions/redacted/resourceGroups/rgl-test-vault-rg/providers/Microsoft.Network/networkInterfaces/nic-80b9ff5f",
        ]
        priority                        = "Regular"
      ~ private_ip_address              = "10.0.1.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.1.4",
        ] -> (known after apply)
        provision_vm_agent              = true
      ~ public_ip_address               = "redacted" -> (known after apply)
      ~ public_ip_addresses             = [
          - "redacted",
        ] -> (known after apply)
        resource_group_name             = "rgl-test-vault-rg"
        size                            = "Standard_DS1_v2"
        tags                            = {
            "environment" = "rgl-test-80b9ff5f"
        }
      ~ virtual_machine_id              = "e5372b7d-dab3-4867-a118-c67b6303643e" -> (known after apply)
      + zone                            = (known after apply)

        admin_ssh_key {
            public_key = "redacted"
            username   = "azureuser"
        }

        boot_diagnostics {
            storage_account_uri = "https://sa80b9ff5f.blob.core.windows.net/"
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "redacted" -> (known after apply)
          ~ tenant_id    = "redacted" -> (known after apply)
            type         = "SystemAssigned"
        }

      ~ os_disk {
            caching                   = "ReadWrite"
          ~ disk_size_gb              = 30 -> (known after apply)
            name                      = "azure-auth-demo-vm-os"
            storage_account_type      = "Premium_LRS"
            write_accelerator_enabled = false
        }

        source_image_reference {
            offer     = "UbuntuServer"
            publisher = "Canonical"
            sku       = "18.04-LTS"
            version   = "latest"
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

I'm not sure if this helps, here's the output of `terraform graph | dot -Tpdf >graph.pdf`:

[graph.pdf](https://github.com/terraform-providers/terraform-provider-azurerm/files/4997006/graph.pdf)
